cluster/cluster-load-test.yml

config:
  target: http://localhost:3000
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 30
      name: Warm up phase
    - duration: 20
      arrivalRate: 30
      rampTo: 30
      name:  Stable phase
    - duration: 20
      arrivalRate: 30
      rampTo: 100
      name: Ramp up 
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: '/'
        count: 5